_pages/bbm.html
---
permalink: /bbm/
title: "BBM"
---

<p>
Some Generall notes, based on various Talks and Videos mostly focusing on Recon
It is basically a Massive list of tools and a short description of the purpose,
all started with the following talk from @JHaddix
</p>

<p>
Bug Hunters Methodology V4.0
<a href="https://www.youtube.com/watch?v=p4JgIu1mceI&amp;t=462s">https://www.youtube.com/watch?v=p4JgIu1mceI&amp;t=462s</a>
</p>

<p>
This is the Basis of this list, everthing else I read/heard somewere else :)
</p>

<div id="outline-container-orga170e29" class="outline-2">
<h2 id="orga170e29"><span class="section-number-2">1</span> General</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf8d2be8" class="outline-3">
<h3 id="orgf8d2be8"><span class="section-number-3">1.1</span> Links</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>TODO checkout the study Guides
<a href="https://danielmiessler.com/study/">https://danielmiessler.com/study/</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org88feb9f" class="outline-2">
<h2 id="org88feb9f"><span class="section-number-2">2</span> Seed domain gathering</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc71e476" class="outline-3">
<h3 id="orgc71e476"><span class="section-number-3">2.1</span> Domains inscope</h3>
<div class="outline-text-3" id="text-2-1">
<p>
From Bugbounty programms
</p>
</div>
</div>
<div id="outline-container-org330690d" class="outline-3">
<h3 id="org330690d"><span class="section-number-3">2.2</span> Aquisitions</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Crunchbase</li>
<li>Wikipedia</li>
<li>Google</li>
</ul>
</div>
</div>

<div id="outline-container-org1f8093c" class="outline-3">
<h3 id="org1f8093c"><span class="section-number-3">2.3</span> ASN Enumeration</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Only relevant for bigger companies
</p>
<ul class="org-ul">
<li>bgp.he.net
Homepage for ASN enumeration</li>
<li>ASNlookaup
Need to double check if really in scope</li>
<li>Metabigor
Need to double check if really in scope</li>
<li>Amass
amass intel -asn xxxxx</li>
</ul>
</div>
</div>
<div id="outline-container-orgd3c13ea" class="outline-3">
<h3 id="orgd3c13ea"><span class="section-number-3">2.4</span> Reverse WHOIS</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>whoxy.com</li>
<li>DOMLink
will query whoxy from the cmd line
recursive tool, will also lookup all the found names</li>
</ul>
</div>
</div>
<div id="outline-container-orgeee560e" class="outline-3">
<h3 id="orgeee560e"><span class="section-number-3">2.5</span> Ad/Analytics Releationships</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>builtwith.com
Basically a technology tracker
Relationship Profile, will show ad tracking codes</li>
</ul>
</div>
</div>

<div id="outline-container-org1c3e6c4" class="outline-3">
<h3 id="org1c3e6c4"><span class="section-number-3">2.6</span> Google FU</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Copyright text, inurl: etc.
</p>
</div>
</div>
<div id="outline-container-org42e921c" class="outline-3">
<h3 id="org42e921c"><span class="section-number-3">2.7</span> Shodan</h3>
<div class="outline-text-3" id="text-2-7">
<p>
General tool to get info about URLs, especially location/certificates etc.
</p>
</div>
</div>
</div>
<div id="outline-container-org113ed3f" class="outline-2">
<h2 id="org113ed3f"><span class="section-number-2">3</span> Subdomain gathering</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org445b629" class="outline-3">
<h3 id="org445b629"><span class="section-number-3">3.1</span> Link discovery</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Spidering via Burp Suit Pro
Recursion has to be done on you own</li>
<li>GoSpider
Need to do recursion externally</li>
<li>hakrawler
Recursive is possible</li>
<li>Subdomainizer
Parsing mainly JS in order to find subdomains
also search for Keys</li>
<li>Subscraper
Recursive JS scraper</li>
</ul>
</div>
</div>
<div id="outline-container-org75189fd" class="outline-3">
<h3 id="org75189fd"><span class="section-number-3">3.2</span> Subdomain Scraping</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Amass
Most sources, brute forcing options&#x2026;
Also shows ASN in results -&gt; might be a new ASN to restart on Seed domain discovery</li>
<li>Subfinder
Uses other sources, can be used in parallel</li>
<li>github-subdomains.py
Will scraping github for subdomains, often not referenced.
API is rate limited&#x2026; ensure waittimes</li>
<li>shosubgo
Parser for Shodan</li>
<li>Scraping in Cloud ranges
No tool, but easy to do via
<a href="https://tls.bufferover.run/">https://tls.bufferover.run/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0b63ea2" class="outline-3">
<h3 id="org0b63ea2"><span class="section-number-3">3.3</span> Subdomain Bruteforcing</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Amass
Uses 8 resolvers per default
builtin list,</li>
<li>MassDNS</li>
<li>shuffleDNS
Wrapper around MassDNS</li>
</ul>
</div>
</div>
<div id="outline-container-org5831126" class="outline-3">
<h3 id="org5831126"><span class="section-number-3">3.4</span> Alternation Scanning</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Using alternation/mutations on words
Already part of Amass
</p>
<ul class="org-ul">
<li>altdns
<a href="https://github.com/infosec-au/altdns">https://github.com/infosec-au/altdns</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org068bd8c" class="outline-2">
<h2 id="org068bd8c"><span class="section-number-2">4</span> Others</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgf926e0e" class="outline-3">
<h3 id="orgf926e0e"><span class="section-number-3">4.1</span> Portscanning</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>masscan
For general scanning, just finding open ports, only uses IPs, no domains
<a href="https://github.com/robertdavidgraham/masscan">https://github.com/robertdavidgraham/masscan</a></li>
<li>dnmasscan
<a href="https://github.com/rastating/dnmasscan">https://github.com/rastating/dnmasscan</a>
Wrapper to be able to use domains, for masscan</li>
<li>nmap
fancy scanning only the open ports to save time</li>
</ul>
</div>
</div>

<div id="outline-container-org4857412" class="outline-3">
<h3 id="org4857412"><span class="section-number-3">4.2</span> Service Scanning</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>brutespray
<a href="https://github.com/x90skysn3k/brutespray">https://github.com/x90skysn3k/brutespray</a>
For default credential brute forcing</li>
</ul>
</div>
</div>

<div id="outline-container-orga555861" class="outline-3">
<h3 id="orga555861"><span class="section-number-3">4.3</span> Github Dorking</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>TODO Listen to "Github and Sensitive data Exposure"</li>
</ul>
</div>
</div>

<div id="outline-container-org8ddeee1" class="outline-3">
<h3 id="org8ddeee1"><span class="section-number-3">4.4</span> Screenshotting</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>httpprobe
Not really screenshotting, but goot as prefilter, if domain is up</li>
<li>eyewitness
<a href="https://github.com/FortyNorthSecurity/EyeWitness">https://github.com/FortyNorthSecurity/EyeWitness</a></li>
<li>aquatone
<a href="https://github.com/michenriksen/aquatone">https://github.com/michenriksen/aquatone</a></li>
<li>httpscreenshot
<a href="https://github.com/breenmachine/httpscreenshot">https://github.com/breenmachine/httpscreenshot</a></li>
</ul>
</div>
</div>

<div id="outline-container-org86cddfc" class="outline-3">
<h3 id="org86cddfc"><span class="section-number-3">4.5</span> Subdomain takeover</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>can-i-take-over-xyz
<a href="https://github.com/EdOverflow/can-i-take-over-xyz">https://github.com/EdOverflow/can-i-take-over-xyz</a></li>
<li>subover
<a href="https://github.com/Ice3man543/SubOver">https://github.com/Ice3man543/SubOver</a></li>
<li>nuclei
<a href="https://github.com/projectdiscovery/nuclei">https://github.com/projectdiscovery/nuclei</a>
Bigger Framework, can do a ton of stuff, also includes Subdomain-takeover</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgba08d7b" class="outline-2">
<h2 id="orgba08d7b"><span class="section-number-2">5</span> Automation</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org0abdb2e" class="outline-3">
<h3 id="org0abdb2e"><span class="section-number-3">5.1</span> Extending tools</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>interlace
<a href="https://github.com/codingo/Interlace">https://github.com/codingo/Interlace</a>
Thread/proxy different commands</li>
<li>@tomnomnom
Various tools, all are amazing, expecially CLI centered</li>
</ul>
<p>
-* httpprobe
-* waybackurls
-* meg
-* gf
-* assetfinder
</p>
</div>
</div>
</div>

<div id="outline-container-org90a1684" class="outline-2">
<h2 id="org90a1684"><span class="section-number-2">6</span> Wordlists</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orge97e4b9" class="outline-3">
<h3 id="orge97e4b9"><span class="section-number-3">6.1</span> General</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>clean<sub>wordlist.sh</sub>
Wordlist cleanup, avoid unneccesary requests.</li>
</ul>
</div>
</div>
<div id="outline-container-org441b1fe" class="outline-3">
<h3 id="org441b1fe"><span class="section-number-3">6.2</span> Massive wordlist</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>api wordlist
wordlist.assetnote.io</li>
<li>all.txt
Massive list from Jason Haddix</li>
<li>commonspeak
<a href="https://github.com/assetnote/commonspeak2">https://github.com/assetnote/commonspeak2</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgce22ba1" class="outline-3">
<h3 id="orgce22ba1"><span class="section-number-3">6.3</span> Tailored wordlist</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Talk @tomnomnom on nahamcon
</p>
<ul class="org-ul">
<li>cewl
Basic tool for word list generation based on Homepages</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc2dcfaa" class="outline-2">
<h2 id="orgc2dcfaa"><span class="section-number-2">7</span> Exploit tooling</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgac6f4a8" class="outline-3">
<h3 id="orgac6f4a8"><span class="section-number-3">7.1</span> 403 Forbidden</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>byp4xx.sh</li>
</ul>
</div>
</div>
</div>
